package allTasks.taskFour;

public class CorrectSequence {

// todo   Дана скобочная последовательность: [((())()(())]]
//   - Можно ли считать эту последовательность правильной?
//  - Если ответ на предыдущий вопрос “нет” - то что необходимо в ней изменить, чтоб она стала правильной?

// todo   Последовательность является правильной если колличество открывающихся скобок одного вида равна колличеству
//    закрывающихся скобок одного вида если последовательность начинается с закрывающей скобки,
//    то значит уже ошибка и анализировать дальше нет смысла.

// todo   Последовательность  в задачи имеет 6 открывающихся  и 5 закрывающихся скобок полукруглого типа
//     соответсвенно нужно дабавить 1 закрывающуюся скобку или убрать 1 открывающуюся скобку

 // todo   Последовательность  в задачи имеет 1 открывающуюся  и 2 закрывающихся скобоки квадратного типа
//     соответсвенно нужно дабавить 1 открывающуюся скобку или убрать 1 закрывающуюся скобку


}